Masmiseim36/nxpSDK/boards/twrkm35z75m/bootloader_examples/demo_apps/led_demo_tower_0000/pin_mux.h
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTJ3 (number 62), D3/GRN
  @{ */
#define BOARD_LED_GREEN_FGPIO FGPIOJ /*!<@brief FGPIO device name: FGPIOJ */
#define BOARD_LED_GREEN_GPIO GPIOJ /*!<@brief GPIO device name: GPIOJ */
#define BOARD_LED_GREEN_PORT PORTJ /*!<@brief PORT device name: PORTJ */
#define BOARD_LED_GREEN_PIN 3U     /*!<@brief PORTJ pin index: 3 */
                                   /* @} */

/*! @name PORTJ4 (number 63), D4/RED
  @{ */
#define BOARD_LED_RED_FGPIO FGPIOJ /*!<@brief FGPIO device name: FGPIOJ */
#define BOARD_LED_RED_GPIO GPIOJ /*!<@brief GPIO device name: GPIOJ */
#define BOARD_LED_RED_PORT PORTJ /*!<@brief PORT device name: PORTJ */
#define BOARD_LED_RED_PIN 4U     /*!<@brief PORTJ pin index: 4 */
                                 /* @} */

/*! @name PORTD0 (number 61), J17[2]/J19[1]/J25[17]/D5/ORANGE/IRDRJ/CMP0_IN0
  @{ */
#define BOARD_LED_ORANGE_FGPIO FGPIOD /*!<@brief FGPIO device name: FGPIOD */
#define BOARD_LED_ORANGE_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_LED_ORANGE_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_LED_ORANGE_PIN 0U     /*!<@brief PORTD pin index: 0 */
                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
